espressif/arduino-esp32/libraries/Network/src/NetworkInterface.cpp
/*
 * SPDX-FileCopyrightText: 2023 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#include "NetworkInterface.h"
#include "esp_netif.h"
#include "esp_netif_defaults.h"
#include "esp_system.h"
#include "lwip/ip_addr.h"
#include "lwip/err.h"
#include "lwip/netif.h"
#include "dhcpserver/dhcpserver.h"
#include "dhcpserver/dhcpserver_options.h"
#include "esp32-hal-log.h"

static NetworkInterface * _interfaces[ESP_NETIF_ID_MAX] = { NULL, NULL, NULL, NULL, NULL, NULL};
static esp_event_handler_instance_t _ip_ev_instance = NULL;

static NetworkInterface * getNetifByEspNetif(esp_netif_t *esp_netif){
    for (int i = 0; i < ESP_NETIF_ID_MAX; ++i){
        if(_interfaces[i] != NULL && _interfaces[i]->netif() == esp_netif){
            return _interfaces[i];
        }
    }
    return NULL;
}

NetworkInterface * getNetifByID(Network_Interface_ID id){
    if(id < ESP_NETIF_ID_MAX){
        return _interfaces[id];
    }
    return NULL;
}

static void _ip_event_cb(void* arg, esp_event_base_t event_base, int32_t event_id, void* event_data) {
    if (event_base == IP_EVENT){
        NetworkInterface * netif = NULL;
        if(event_id == IP_EVENT_STA_GOT_IP || event_id == IP_EVENT_ETH_GOT_IP || event_id == IP_EVENT_PPP_GOT_IP){
            ip_event_got_ip_t* event = (ip_event_got_ip_t*) event_data;
            netif = getNetifByEspNetif(event->esp_netif);
        } else if(event_id == IP_EVENT_STA_LOST_IP || event_id == IP_EVENT_PPP_LOST_IP || event_id == IP_EVENT_ETH_LOST_IP){
            ip_event_got_ip_t* event = (ip_event_got_ip_t*) event_data;
            netif = getNetifByEspNetif(event->esp_netif);
        } else if(event_id == IP_EVENT_GOT_IP6){
            ip_event_got_ip6_t* event = (ip_event_got_ip6_t*) event_data;
            netif = getNetifByEspNetif(event->esp_netif);
        } else if(event_id == IP_EVENT_AP_STAIPASSIGNED){
            ip_event_ap_staipassigned_t* event = (ip_event_ap_staipassigned_t*) event_data;
            netif = getNetifByEspNetif(event->esp_netif);
        }
        if(netif != NULL){
            netif->_onIpEvent(event_id, event_data);
        }
    }
}

void NetworkInterface::_onIpEvent(int32_t event_id, void* event_data){
    arduino_event_t arduino_event;
    arduino_event.event_id = ARDUINO_EVENT_MAX;
    if(event_id == _got_ip_event_id){
        setStatusBits(ESP_NETIF_HAS_IP_BIT);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_VERBOSE
        ip_event_got_ip_t* event = (ip_event_got_ip_t*) event_data;
        log_v("%s Got %sIP: " IPSTR " MASK: " IPSTR " GW: " IPSTR, desc(), event->ip_changed?"New ":"Same ", IP2STR(&event->ip_info.ip), IP2STR(&event->ip_info.netmask), IP2STR(&event->ip_info.gw));
#endif
        memcpy(&arduino_event.event_info.got_ip, event_data, sizeof(ip_event_got_ip_t));
#if SOC_WIFI_SUPPORTED
        if(_interface_id == ESP_NETIF_ID_STA){
            arduino_event.event_id = ARDUINO_EVENT_WIFI_STA_GOT_IP;
        } else
#endif
        // if(_interface_id == ESP_NETIF_ID_PPP){
        //     arduino_event.event_id = ARDUINO_EVENT_PPP_GOT_IP;
        // } else 
        if(_interface_id >= ESP_NETIF_ID_ETH && _interface_id < ESP_NETIF_ID_MAX){
            arduino_event.event_id = ARDUINO_EVENT_ETH_GOT_IP;
        }
    } else if(event_id == _lost_ip_event_id){
        clearStatusBits(ESP_NETIF_HAS_IP_BIT);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_VERBOSE
        log_v("%s Lost IP", desc());
#endif
#if SOC_WIFI_SUPPORTED
        if(_interface_id == ESP_NETIF_ID_STA){
            arduino_event.event_id = ARDUINO_EVENT_WIFI_STA_LOST_IP;
        } else 
#endif
        // if(_interface_id == ESP_NETIF_ID_PPP){
        //     arduino_event.event_id = ARDUINO_EVENT_PPP_LOST_IP;
        // } else 
        if(_interface_id >= ESP_NETIF_ID_ETH && _interface_id < ESP_NETIF_ID_MAX){
            arduino_event.event_id = ARDUINO_EVENT_ETH_LOST_IP;
        }
    } else if(event_id == IP_EVENT_GOT_IP6){
        ip_event_got_ip6_t* event = (ip_event_got_ip6_t*) event_data;
        esp_ip6_addr_type_t addr_type = esp_netif_ip6_get_addr_type(&event->ip6_info.ip);
        if(addr_type == ESP_IP6_ADDR_IS_GLOBAL){
            setStatusBits(ESP_NETIF_HAS_GLOBAL_IP6_BIT);
        } else if(addr_type == ESP_IP6_ADDR_IS_LINK_LOCAL){
            setStatusBits(ESP_NETIF_HAS_LOCAL_IP6_BIT);
        }
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_VERBOSE        
        char if_name[NETIF_NAMESIZE] = {0,};
        netif_index_to_name(event->ip6_info.ip.zone, if_name);
        static const char * addr_types[] = { "UNKNOWN", "GLOBAL", "LINK_LOCAL", "SITE_LOCAL", "UNIQUE_LOCAL", "IPV4_MAPPED_IPV6" };
        log_v("IF %s Got IPv6: Interface: %d, IP Index: %d, Type: %s, Zone: %d (%s), Address: " IPV6STR, desc(), _interface_id, event->ip_index, addr_types[addr_type], event->ip6_info.ip.zone, if_name, IPV62STR(event->ip6_info.ip));
#endif
        memcpy(&arduino_event.event_info.got_ip6, event_data, sizeof(ip_event_got_ip6_t));
#if SOC_WIFI_SUPPORTED
        if(_interface_id == ESP_NETIF_ID_STA){
            arduino_event.event_id = ARDUINO_EVENT_WIFI_STA_GOT_IP6;
        } else if(_interface_id == ESP_NETIF_ID_AP){
            arduino_event.event_id = ARDUINO_EVENT_WIFI_AP_GOT_IP6;
        } else 
#endif
        // if(_interface_id == ESP_NETIF_ID_PPP){
        //     arduino_event.event_id = ARDUINO_EVENT_PPP_GOT_IP6;
        // } else 
        if(_interface_id >= ESP_NETIF_ID_ETH && _interface_id < ESP_NETIF_ID_MAX){
            arduino_event.event_id = ARDUINO_EVENT_ETH_GOT_IP6;
        }
#if SOC_WIFI_SUPPORTED
    } else if(event_id == IP_EVENT_AP_STAIPASSIGNED && _interface_id == ESP_NETIF_ID_AP){
        setStatusBits(ESP_NETIF_HAS_IP_BIT);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_VERBOSE
        ip_event_ap_staipassigned_t* event = (ip_event_ap_staipassigned_t*) event_data;
        log_v("%s Assigned IP: " IPSTR " to MAC: %02X:%02X:%02X:%02X:%02X:%02X", desc(), IP2STR(&event->ip), event->mac[0], event->mac[1], event->mac[2], event->mac[3], event->mac[4], event->mac[5]);
#endif
        arduino_event.event_id = ARDUINO_EVENT_WIFI_AP_STAIPASSIGNED;
        memcpy(&arduino_event.event_info.wifi_ap_staipassigned, event_data, sizeof(ip_event_ap_staipassigned_t));
#endif
    }
    
    if(arduino_event.event_id < ARDUINO_EVENT_MAX){
        Network.postEvent(&arduino_event);
    }
}

NetworkInterface::NetworkInterface()
    : _esp_netif(NULL)
    , _interface_event_group(NULL)
    , _initial_bits(0)
    , _got_ip_event_id(-1)
    , _lost_ip_event_id(-1)
    , _interface_id(ESP_NETIF_ID_MAX)
    , _is_server_if(false)
{}

NetworkInterface::~NetworkInterface(){
    destroyNetif();
}

