espressif/arduino-esp32/libraries/Network/src/NetworkInterface.cpp
IPAddress NetworkInterface::calculateNetworkID(IPAddress ip, IPAddress subnet) const {
	IPAddress networkID;

	for (size_t i = 0; i < 4; i++)
		networkID[i] = subnet[i] & ip[i];

	return networkID;
}

IPAddress NetworkInterface::calculateBroadcast(IPAddress ip, IPAddress subnet) const {
    IPAddress broadcastIp;
    
    for (int i = 0; i < 4; i++)
        broadcastIp[i] = ~subnet[i] | ip[i];

    return broadcastIp;
}

uint8_t NetworkInterface::calculateSubnetCIDR(IPAddress subnetMask) const {
	uint8_t CIDR = 0;

	for (uint8_t i = 0; i < 4; i++) {
		if (subnetMask[i] == 0x80)  // 128
			CIDR += 1;
		else if (subnetMask[i] == 0xC0)  // 192
			CIDR += 2;
		else if (subnetMask[i] == 0xE0)  // 224
			CIDR += 3;
		else if (subnetMask[i] == 0xF0)  // 242
			CIDR += 4;
		else if (subnetMask[i] == 0xF8)  // 248
			CIDR += 5;
		else if (subnetMask[i] == 0xFC)  // 252
			CIDR += 6;
		else if (subnetMask[i] == 0xFE)  // 254
			CIDR += 7;
		else if (subnetMask[i] == 0xFF)  // 255
			CIDR += 8;
	}

	return CIDR;
}

int NetworkInterface::setStatusBits(int bits) {
    if(!_interface_event_group){
        _initial_bits |= bits;
        return _initial_bits;
    }
    return xEventGroupSetBits(_interface_event_group, bits);
}

int NetworkInterface::clearStatusBits(int bits) {
    if(!_interface_event_group){
        _initial_bits &= ~bits;
        return _initial_bits;
    }
    return xEventGroupClearBits(_interface_event_group, bits) ;
}

int NetworkInterface::getStatusBits() const {
    if(!_interface_event_group){
        return _initial_bits;
    }
    return xEventGroupGetBits(_interface_event_group);
}

int NetworkInterface::waitStatusBits(int bits, uint32_t timeout_ms) const {
    if(!_interface_event_group){
        return 0;
    }
    bits = xEventGroupWaitBits(
        _interface_event_group, // The event group being tested.
        bits, // The bits within the event group to wait for.
        pdFALSE, // bits should be cleared before returning.
        pdTRUE, // Don't wait for all bits, any bit will do.
        timeout_ms / portTICK_PERIOD_MS ) & bits; // Wait a maximum of timeout_ms for any bit to be set.
    return bits;
}

void NetworkInterface::destroyNetif() {
    if(_ip_ev_instance != NULL){
        esp_event_handler_unregister(IP_EVENT, ESP_EVENT_ANY_ID, &_ip_event_cb);
        _ip_ev_instance = NULL;
    }
    if(_esp_netif != NULL){
        esp_netif_destroy(_esp_netif);
        _esp_netif = NULL;
    }
    if(_interface_event_group != NULL){
        vEventGroupDelete(_interface_event_group);
        _interface_event_group = NULL;
        _initial_bits = 0;
    }
}

bool NetworkInterface::initNetif(Network_Interface_ID interface_id, bool server_interface) {
    if(_esp_netif == NULL || interface_id >= ESP_NETIF_ID_MAX){
        return false;
    }
    _is_server_if = server_interface;
    _interface_id = interface_id;
    _got_ip_event_id = esp_netif_get_event_id(_esp_netif, ESP_NETIF_IP_EVENT_GOT_IP);
    _lost_ip_event_id = esp_netif_get_event_id(_esp_netif, ESP_NETIF_IP_EVENT_LOST_IP);
    _interfaces[_interface_id] = this;

    if(_interface_event_group == NULL){
        _interface_event_group = xEventGroupCreate();
        if(!_interface_event_group){
            log_e("Interface Event Group Create Failed!");
            return false;
        }
        setStatusBits(_initial_bits);
    }

    if(_ip_ev_instance == NULL && esp_event_handler_instance_register(IP_EVENT, ESP_EVENT_ANY_ID, &_ip_event_cb, NULL, &_ip_ev_instance)){
        log_e("event_handler_instance_register for IP_EVENT Failed!");
        return false;
    }
    return true;
}

bool NetworkInterface::started() const {
    return (getStatusBits() & ESP_NETIF_STARTED_BIT) != 0;
}

bool NetworkInterface::connected() const {
    return (getStatusBits() & ESP_NETIF_CONNECTED_BIT) != 0;
}

bool NetworkInterface::hasIP() const {
    return (getStatusBits() & ESP_NETIF_HAS_IP_BIT) != 0;
}

bool NetworkInterface::hasLinkLocalIPv6() const {
    return (getStatusBits() & ESP_NETIF_HAS_LOCAL_IP6_BIT) != 0;
}

bool NetworkInterface::hasGlobalIPv6() const {
    return (getStatusBits() & ESP_NETIF_HAS_GLOBAL_IP6_BIT) != 0;
}

bool NetworkInterface::enableIPv6(bool en)
{
    if (en) {
        setStatusBits(ESP_NETIF_WANT_IP6_BIT);
    } else {
        clearStatusBits(ESP_NETIF_WANT_IP6_BIT);
    }
    return true;
}

bool NetworkInterface::dnsIP(uint8_t dns_no, IPAddress ip)
{
    if(_esp_netif == NULL || dns_no > 2){
        return false;
    }
    if(_is_server_if && dns_no > 0){
        log_e("Server interfaces can have only one DNS server.");
        return false;
    }
    esp_netif_dns_info_t d;
    // ToDo: can this work with IPv6 addresses?
    d.ip.type = IPADDR_TYPE_V4;
    if(static_cast<uint32_t>(ip) != 0){
        d.ip.u_addr.ip4.addr = static_cast<uint32_t>(ip);
    } else {
        d.ip.u_addr.ip4.addr = 0;
    }
    if(esp_netif_set_dns_info(_esp_netif, (esp_netif_dns_type_t)dns_no, &d) != ESP_OK){
        return false;
    }
    return true;
}

bool NetworkInterface::config(IPAddress local_ip, IPAddress gateway, IPAddress subnet, IPAddress dns1, IPAddress dns2, IPAddress dns3)
{
    if(_esp_netif == NULL){
        return false;
    }
    esp_err_t err = ESP_OK;
    esp_netif_ip_info_t info;
    esp_netif_dns_info_t d1;
    esp_netif_dns_info_t d2;
    esp_netif_dns_info_t d3;
    d1.ip.type = IPADDR_TYPE_V4;
    d2.ip.type = IPADDR_TYPE_V4;
    d3.ip.type = IPADDR_TYPE_V4;

    if(static_cast<uint32_t>(local_ip) != 0){
        info.ip.addr = static_cast<uint32_t>(local_ip);
        info.gw.addr = static_cast<uint32_t>(gateway);
        info.netmask.addr = static_cast<uint32_t>(subnet);
        d1.ip.u_addr.ip4.addr = static_cast<uint32_t>(dns1);
        d2.ip.u_addr.ip4.addr = static_cast<uint32_t>(dns2);
        d3.ip.u_addr.ip4.addr = static_cast<uint32_t>(dns3);
    } else {
        info.ip.addr = 0;
        info.gw.addr = 0;
        info.netmask.addr = 0;
        d1.ip.u_addr.ip4.addr = 0;
        d2.ip.u_addr.ip4.addr = 0;
        d3.ip.u_addr.ip4.addr = 0;
	}

    if(_is_server_if){
        // Stop DHCPS
        err = esp_netif_dhcps_stop(_esp_netif);
        if(err && err != ESP_ERR_ESP_NETIF_DHCP_ALREADY_STOPPED){
            log_e("DHCPS Stop Failed! 0x%04x: %s", err, esp_err_to_name(err));
            return false;
        }

        // Set IPv4, Netmask, Gateway
        err = esp_netif_set_ip_info(_esp_netif, &info);
        if(err){
            log_e("Netif Set IP Failed! 0x%04x: %s", err, esp_err_to_name(err));
            return false;
        }
        
        // Set DNS Server
        if(d2.ip.u_addr.ip4.addr != 0){
            esp_netif_set_dns_info(_esp_netif, ESP_NETIF_DNS_MAIN, &d2);
        }

        dhcps_lease_t lease;
        lease.enable = true;
        uint8_t CIDR = calculateSubnetCIDR(subnet);
        log_v("SoftAP: %s | Gateway: %s | DHCP Start: %s | Netmask: %s", local_ip.toString().c_str(), gateway.toString().c_str(), dns1.toString().c_str(), subnet.toString().c_str());
        // netmask must have room for at least 12 IP addresses (AP + GW + 10 DHCP Leasing addresses)
        // netmask also must be limited to the last 8 bits of IPv4, otherwise this function won't work
        // IDF NETIF checks netmask for the 3rd byte: https://github.com/espressif/esp-idf/blob/master/components/esp_netif/lwip/esp_netif_lwip.c#L1857-L1862
        if (CIDR > 28 || CIDR < 24) {
            log_e("Bad netmask. It must be from /24 to /28 (255.255.255. 0<->240)");
            return false; //  ESP_FAIL if initializing failed
        }
        #define _byte_swap32(num) (((num>>24)&0xff) | ((num<<8)&0xff0000) | ((num>>8)&0xff00) | ((num<<24)&0xff000000))
        // The code below is ready for any netmask, not limited to 255.255.255.0
        uint32_t netmask = _byte_swap32(info.netmask.addr);
        uint32_t ap_ipaddr = _byte_swap32(info.ip.addr);
        uint32_t dhcp_ipaddr = _byte_swap32(static_cast<uint32_t>(dns1));
        dhcp_ipaddr = dhcp_ipaddr == 0 ? ap_ipaddr + 1 : dhcp_ipaddr;
        uint32_t leaseStartMax = ~netmask - 10;
        // there will be 10 addresses for DHCP to lease
        lease.start_ip.addr = dhcp_ipaddr;
        lease.end_ip.addr = lease.start_ip.addr + 10;
        // Check if local_ip is in the same subnet as the dhcp leasing range initial address
        if ((ap_ipaddr & netmask) != (dhcp_ipaddr & netmask)) {
            log_e("The AP IP address (%s) and the DHCP start address (%s) must be in the same subnet", 
                local_ip.toString().c_str(), IPAddress(_byte_swap32(dhcp_ipaddr)).toString().c_str());
            return false; //  ESP_FAIL if initializing failed
        }
        // prevents DHCP lease range to overflow subnet range
        if ((dhcp_ipaddr & ~netmask) >= leaseStartMax) {
            // make first DHCP lease addr stay in the begining of the netmask range
            lease.start_ip.addr = (dhcp_ipaddr & netmask) + 1;
            lease.end_ip.addr = lease.start_ip.addr + 10;
            log_w("DHCP Lease out of range - Changing DHCP leasing start to %s", IPAddress(_byte_swap32(lease.start_ip.addr)).toString().c_str());
        }
        // Check if local_ip is within DHCP range
        if (ap_ipaddr >= lease.start_ip.addr && ap_ipaddr <= lease.end_ip.addr) {
            log_e("The AP IP address (%s) can't be within the DHCP range (%s -- %s)", 
                local_ip.toString().c_str(), IPAddress(_byte_swap32(lease.start_ip.addr)).toString().c_str(), IPAddress(_byte_swap32(lease.end_ip.addr)).toString().c_str());
            return false; //  ESP_FAIL if initializing failed
        }
        // Check if gateway is within DHCP range
        uint32_t gw_ipaddr = _byte_swap32(info.gw.addr);
        bool gw_in_same_subnet = (gw_ipaddr & netmask) == (ap_ipaddr & netmask);
        if (gw_in_same_subnet && gw_ipaddr >= lease.start_ip.addr && gw_ipaddr <= lease.end_ip.addr) {
            log_e("The GatewayP address (%s) can't be within the DHCP range (%s -- %s)", 
                gateway.toString().c_str(), IPAddress(_byte_swap32(lease.start_ip.addr)).toString().c_str(), IPAddress(_byte_swap32(lease.end_ip.addr)).toString().c_str());
            return false; //  ESP_FAIL if initializing failed
        }
        // all done, just revert back byte order of DHCP lease range
        lease.start_ip.addr = _byte_swap32(lease.start_ip.addr);
        lease.end_ip.addr = _byte_swap32(lease.end_ip.addr);
        log_v("DHCP Server Range: %s to %s", IPAddress(lease.start_ip.addr).toString().c_str(), IPAddress(lease.end_ip.addr).toString().c_str());
        err = esp_netif_dhcps_option(
            _esp_netif,
            ESP_NETIF_OP_SET,
            ESP_NETIF_REQUESTED_IP_ADDRESS,
            (void*)&lease, sizeof(dhcps_lease_t)
        );
        if(err){
            log_e("DHCPS Set Lease Failed! 0x%04x: %s", err, esp_err_to_name(err));
            return false;
        }
        // Start DHCPS
        err = esp_netif_dhcps_start(_esp_netif);
        if(err){
            log_e("DHCPS Start Failed! 0x%04x: %s", err, esp_err_to_name(err));
            return false;
        }
    } else {
        // Stop DHCPC
        err = esp_netif_dhcpc_stop(_esp_netif);
        if(err != ESP_OK && err != ESP_ERR_ESP_NETIF_DHCP_ALREADY_STOPPED){
            log_e("DHCP could not be stopped! Error: 0x%04x: %s", err, esp_err_to_name(err));
            return false;
        }

        clearStatusBits(ESP_NETIF_HAS_IP_BIT);

        // Set IPv4, Netmask, Gateway
        err = esp_netif_set_ip_info(_esp_netif, &info);
        if(err != ERR_OK){
            log_e("ETH IP could not be configured! Error: 0x%04x: %s", err, esp_err_to_name(err));
            return false;
        }
        
