espressif/arduino-esp32/libraries/Network/src/NetworkInterface.cpp
        // Set DNS Servers
        esp_netif_set_dns_info(_esp_netif, ESP_NETIF_DNS_MAIN, &d1);
        esp_netif_set_dns_info(_esp_netif, ESP_NETIF_DNS_BACKUP, &d2);
        esp_netif_set_dns_info(_esp_netif, ESP_NETIF_DNS_FALLBACK, &d3);

        // Start DHCPC if static IP was set
        if(info.ip.addr == 0){
            err = esp_netif_dhcpc_start(_esp_netif);
            if(err != ESP_OK && err != ESP_ERR_ESP_NETIF_DHCP_ALREADY_STARTED){
                log_w("DHCP could not be started! Error: 0x%04x: %s", err, esp_err_to_name(err));
                return false;
            }
        } else {
            setStatusBits(ESP_NETIF_HAS_IP_BIT);
        }
    }

    return true;
}

const char * NetworkInterface::getHostname() const
{
    if(_esp_netif == NULL){
        return "";
    }
    const char * hostname;
    if(esp_netif_get_hostname(_esp_netif, &hostname)){
        return NULL;
    }
    return hostname;
}

bool NetworkInterface::setHostname(const char * hostname) const
{
    if(_esp_netif == NULL){
        return false;
    }
    return esp_netif_set_hostname(_esp_netif, hostname) == 0;
}

bool NetworkInterface::linkUp() const
{
    if(_esp_netif == NULL){
        return false;
    }
    return esp_netif_is_netif_up(_esp_netif);
}

const char * NetworkInterface::ifkey(void) const
{
    if(_esp_netif == NULL){
        return "";
    }
    return esp_netif_get_ifkey(_esp_netif);
}

const char * NetworkInterface::desc(void) const
{
    if(_esp_netif == NULL){
        return "";
    }
    return esp_netif_get_desc(_esp_netif);
}

String NetworkInterface::impl_name(void) const
{
    if(_esp_netif == NULL){
        return String("");
    }
    char netif_name[8];
    esp_err_t err = esp_netif_get_netif_impl_name(_esp_netif, netif_name);
    if(err != ESP_OK){
        log_e("Failed to get netif impl_name: %d", err);
        return String("");
    }
    return String(netif_name);
}

uint8_t * NetworkInterface::macAddress(uint8_t* mac) const
{
    if(!mac || _esp_netif == NULL){
        return NULL;
    }
    esp_err_t err = esp_netif_get_mac(_esp_netif, mac);
    if(err != ESP_OK){
        log_e("Failed to get netif mac: %d", err);
        return NULL;
    }
    // getMac(mac);
    return mac;
}

String NetworkInterface::macAddress(void) const
{
    uint8_t mac[6] = {0,0,0,0,0,0};
    char macStr[18] = { 0 };
    macAddress(mac);
    sprintf(macStr, "%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    return String(macStr);
}

IPAddress NetworkInterface::localIP() const
{
    if(_esp_netif == NULL){
        return IPAddress();
    }
    esp_netif_ip_info_t ip;
    if(esp_netif_get_ip_info(_esp_netif, &ip)){
        return IPAddress();
    }
    return IPAddress(ip.ip.addr);
}

IPAddress NetworkInterface::subnetMask() const
{
    if(_esp_netif == NULL){
        return IPAddress();
    }
    esp_netif_ip_info_t ip;
    if(esp_netif_get_ip_info(_esp_netif, &ip)){
        return IPAddress();
    }
    return IPAddress(ip.netmask.addr);
}

IPAddress NetworkInterface::gatewayIP() const
{
    if(_esp_netif == NULL){
        return IPAddress();
    }
    esp_netif_ip_info_t ip;
    if(esp_netif_get_ip_info(_esp_netif, &ip)){
        return IPAddress();
    }
    return IPAddress(ip.gw.addr);
}

IPAddress NetworkInterface::dnsIP(uint8_t dns_no) const
{
    if(_esp_netif == NULL){
        return IPAddress();
    }
    esp_netif_dns_info_t d;
    if(esp_netif_get_dns_info(_esp_netif, dns_no?ESP_NETIF_DNS_BACKUP:ESP_NETIF_DNS_MAIN, &d) != ESP_OK){
        return IPAddress();
    }
    return IPAddress(d.ip.u_addr.ip4.addr);
}

IPAddress NetworkInterface::broadcastIP() const
{
    if(_esp_netif == NULL){
        return IPAddress();
    }
    esp_netif_ip_info_t ip;
    if(esp_netif_get_ip_info(_esp_netif, &ip)){
        return IPAddress();
    }
    return calculateBroadcast(IPAddress(ip.gw.addr), IPAddress(ip.netmask.addr));
}

IPAddress NetworkInterface::networkID() const
{
    if(_esp_netif == NULL){
        return IPAddress();
    }
    esp_netif_ip_info_t ip;
    if(esp_netif_get_ip_info(_esp_netif, &ip)){
        return IPAddress();
    }
    return calculateNetworkID(IPAddress(ip.gw.addr), IPAddress(ip.netmask.addr));
}

uint8_t NetworkInterface::subnetCIDR() const
{
    if(_esp_netif == NULL){
        return (uint8_t)0;
    }
    esp_netif_ip_info_t ip;
    if(esp_netif_get_ip_info(_esp_netif, &ip)){
        return (uint8_t)0;
    }
    return calculateSubnetCIDR(IPAddress(ip.netmask.addr));
}

IPAddress NetworkInterface::linkLocalIPv6() const
{
    if(_esp_netif == NULL){
        return IPAddress(IPv6);
    }
    static esp_ip6_addr_t addr;
    if(esp_netif_get_ip6_linklocal(_esp_netif, &addr)){
        return IPAddress(IPv6);
    }
    return IPAddress(IPv6, (const uint8_t *)addr.addr, addr.zone);
}

IPAddress NetworkInterface::globalIPv6() const
{
    if(_esp_netif == NULL){
        return IPAddress(IPv6);
    }
    static esp_ip6_addr_t addr;
    if(esp_netif_get_ip6_global(_esp_netif, &addr)){
        return IPAddress(IPv6);
    }
    return IPAddress(IPv6, (const uint8_t *)addr.addr, addr.zone);
}

size_t NetworkInterface::printTo(Print & out) const {
    size_t bytes = 0;
    bytes += out.print(esp_netif_get_desc(_esp_netif));
    bytes += out.print(":");
    if(esp_netif_is_netif_up(_esp_netif)){
        bytes += out.print(" <UP");
    } else {
        bytes += out.print(" <DOWN");
    }
    bytes += printDriverInfo(out);
    bytes += out.println(">");

    bytes += out.print("      ");
    bytes += out.print("ether ");
    bytes += out.print(macAddress());
    bytes += out.println();

    bytes += out.print("      ");
    bytes += out.print("inet ");
    bytes += out.print(localIP());
    bytes += out.print(" netmask ");
    bytes += out.print(subnetMask());
    bytes += out.print(" broadcast ");
    bytes += out.print(broadcastIP());
    bytes += out.println();

    bytes += out.print("      ");
    bytes += out.print("gateway ");
    bytes += out.print(gatewayIP());
    bytes += out.print(" dns ");
    bytes += out.print(dnsIP());
    bytes += out.println();

    static const char * types[] = { "UNKNOWN", "GLOBAL", "LINK_LOCAL", "SITE_LOCAL", "UNIQUE_LOCAL", "IPV4_MAPPED_IPV6" };
    esp_ip6_addr_t if_ip6[CONFIG_LWIP_IPV6_NUM_ADDRESSES];
    int v6addrs = esp_netif_get_all_ip6(_esp_netif, if_ip6);
    for (int i = 0; i < v6addrs; ++i){
        bytes += out.print("      ");
        bytes += out.print("inet6 ");
        bytes += IPAddress(IPv6, (const uint8_t *)if_ip6[i].addr, if_ip6[i].zone).printTo(out, true);
        bytes += out.print(" type ");
        bytes += out.print(types[esp_netif_ip6_get_addr_type(&if_ip6[i])]);
        bytes += out.println();
    }

    return bytes;
}
